
&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку("---------------------------------------------------------------------------");
	Если НЕ ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда 
		ТекстовыйДокумент.ДобавитьСтроку("  ПРЕДВАРИТЕЛЬНЫЙ ЧЕК, ЗАКАЗ НЕ ЗАКРЫТ");
	КонецЕсли;
	ТекстовыйДокумент.ДобавитьСтроку("  Чек: " + Объект.Номер + "         " + Формат(Объект.ДатаОткрытия,"ДЛФ=ДВ"));
	ТекстовыйДокумент.ДобавитьСтроку("  Стол: " + Объект.НомерСтола);
	ТекстовыйДокумент.ДобавитьСтроку("  Официант: " + Объект.Официант);
	ТекстовыйДокумент.ДобавитьСтроку("---------------------------------------------------------------------------");
	Блюда = Объект.Блюда;
	Для Каждого Позиция из Блюда Цикл
		ТекстовыйДокумент.ДобавитьСтроку("  Наим: " + Позиция.Блюдо + "    Кол-во: " + Позиция.Количество + "    Цена: " + Позиция.Цена + "    Сумма: " + Позиция.Сумма);  
	КонецЦикла;
	ТекстовыйДокумент.ДобавитьСтроку("===========================================================================");
	//Итого = РаботаСоСправочником.ИтоговыйСчёт(Блюда);
	ТекстовыйДокумент.ДобавитьСтроку("  Итого: " + Объект.Блюда.Итог("Сумма") + " руб.");
	ТекстовыйДокумент.ДобавитьСтроку("===========================================================================");
	ТекстовыйДокумент.Показать();

КонецПроцедуры

&НаКлиенте
Процедура БлюдаЦенаПриИзменении(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.Блюда.ТекущиеДанные) ;
КонецПроцедуры

&НаКлиенте
Процедура БлюдаКоличествоПриИзменении(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.Блюда.ТекущиеДанные) ;
КонецПроцедуры

&НаКлиенте
Процедура БлюдаБлюдоПриИзменении(Элемент)
	
	Цена = РаботаСоСправочником.ЦенаНаБлюдо(Объект.ДатаОткрытия, Элементы.Блюда.ТекущиеДанные.Блюдо);
	Элементы.Блюда.ТекущиеДанные.Цена = Цена; 
	Если Элементы.Блюда.ТекущиеДанные.Количество = 0 Тогда 
		Элементы.Блюда.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	РаботаСДокументами.РассчитатьСумму(Элементы.Блюда.ТекущиеДанные);
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Объект.ДатаЗакрытия = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	
	Если  Параметры.Ключ.Пустая() Тогда
		Объект.ДатаОткрытия = ТекущаяДата();
	КонецЕсли; 
	
	ТолькоПросмотр = ЗначениеЗаполнено(Объект.ДатаЗакрытия);
	
КонецПроцедуры
